// console.log();
// alert('Hi'); // бир гана кнопка, ок деген
// confirm('ты тут?');  //ок и отмена бар
// prompt('18 барма?','мында жаз'); // ок и отмена бар + поле для ввода
// document.write('мында жазганын body ишине кетеди');//body ишине жазу

//СОБЕСЕДОВАНИЕДЕ СҰРАҚ 
//null - кайндай тип
// console.log(typeof null); //консольга обьект деп шыгады, бул официально признанная ошибка
//разница префиксный и поствикс
// let incr = 10;
// let decr = 10;
// console.log(++incr,--decr);//11,9 сразу озгереди 
// console.log(incr++,decr--);//11,9 мына строкадан кеин барып озгереди 








